app/controllers/follows_controller.rb

  def following
    @followees = User.find(params[:user_id]).followees
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]