app/controllers/follows_controller.rb

  def index
    @follows = Follow.all
---
SELECT "follows".* FROM "follows"

  def create
    @follow = Follow.new(follow_params)

    if @follow.save
---
INSERT INTO "follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 5], ["followee_id", 9], ["created_at", "2020-04-06 21:34:29.519924"], ["updated_at", "2020-04-06 21:34:29.519924"]]

    def set_follow
      @follow = Follow.find(params[:id])
---
SELECT "follows".* FROM "follows" WHERE "follows"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]