app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "image_url", "blurb", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    @token = encode({user_id: @user.id, username: @user.username});
    if @user.save

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    @current_user.destroy